Revit 2022 API
AnalyticalModelStick.GetReleases Method
 Gets the releases of element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Since: 2016
Syntax
C#
public void GetReleases(
	bool start,
	out bool fx,
	out bool fy,
	out bool fz,
	out bool mx,
	out bool my,
	out bool mz
)
Visual Basic
Public Sub GetReleases ( _
	start As Boolean, _
	<OutAttribute> ByRef fx As Boolean, _
	<OutAttribute> ByRef fy As Boolean, _
	<OutAttribute> ByRef fz As Boolean, _
	<OutAttribute> ByRef mx As Boolean, _
	<OutAttribute> ByRef my As Boolean, _
	<OutAttribute> ByRef mz As Boolean _
)
Visual C++
public:
void GetReleases(
	bool start,
	[OutAttribute] bool% fx,
	[OutAttribute] bool% fy,
	[OutAttribute] bool% fz,
	[OutAttribute] bool% mx,
	[OutAttribute] bool% my,
	[OutAttribute] bool% mz
)
Parameters
start
Type: System.Boolean
 The position on analytical model stick element. True for start, false for end.
fx
Type: System.Boolean
fy
Type: System.Boolean
fz
Type: System.Boolean
mx
Type: System.Boolean
my
Type: System.Boolean
mz
Type: System.Boolean
See Also
AnalyticalModelStick Class
Autodesk.Revit.DB.Structure Namespace